---
kind: other
id: Methods.T:Autodesk.Revit.DB.LayoutRule
source: html/d5769a92-541d-1161-03d2-284a18f31870.htm
---
# LayoutRule Methods

Causes the object to release immediately any resources it may be utilizing.